{
    "lessons": {
        "1": {
            "video_link": "https://www.youtube.com/watch?v=pSvH9vH60Ig",
            "lecture_name" : "The Core Japanese sentence",
            "lecture_summary" : "Teaching how to make A is B and A does B sentences.",
            "lecture_text": "The most basic thing about Japanese is the Japanese core sentence. Every Japanese sentence is fundamentally the same. It has the same core. What does it look like? We're going to picture it as a train. Every Japanese sentence has these two elements: A and B. The main carriage and the engine. The engine is what makes the sentence move, what makes it work. The carriage has to be there because without the carriage there's nothing for the engine to move. Those two things are the core of every Japanese sentence. And if you can understand this, you can understand every sentence, no matter how complicated it becomes. Later on we'll have a lot more carriages. We can say more about A; we can say more about B; we can combine logical sentences together to make complex sentences. But every Japanese sentence conforms to this basic type. So, what are A and B? Let's begin by reminding ourselves that in any language whatever there are only two kinds of sentence. And they are A is B sentences and A does B sentences. So an A does B sentence is 'Sakura walks'. An A is B sentence is 'Sakura is Japanese'. And we can put these into the past tense; we can put them in the negative; we can turn them into questions; we can say more about A; we can say more about B. But, ultimately, every sentence boils down to one of these: an A is B or an A does B sentence. So let's look at how we do this in Japanese. In Japanese, if we want to say 'Sakura walks' (A does B: Sakura walks), then A is Sakura, the main carriage, and B is walks, the thing she does, the engine of the sentence. Walk in Japanese is 'aruku'. And we need one more thing to make the core Japanese sentence. And that is the linchpin of every sentence, and it's が (ga). Make friends with ga, it's the center of Japanese grammar. Every Japanese sentence revolves around ga. Part of the reason that Japanese gets so confusing the way it's taught in the textbooks is that they don't properly explain this. In some sentences we're not going to be able to see the ga, but it's always there, and it's always doing the same job. That may sound a little complicated, but it isn't. It's very simple, and I'm going to explain that in the next lesson. For now, let's just stick with the very simplest kind of sentence. So here is ga. It looks like a post with a big hook on it, doesn't it? It links together A and B and turns them into a sentence. So, our core A does B sentence is 'Sakura ga aruku': 'Sakura walks'. Now let's take an A is B sentence: 'Sakura is Japanese', or, as we say, 'Sakura is a Japanese person'. So, A again is Sakura, B is Nihonjin, which means Japanese person, and once again we need ga to link them together. So we're going to picture the A car, the main carriage, with a ga on it, because the main carriage, the subject of the sentence, aways carries a ga, to link it to the engine. So Sakura ga Nihonjin – and we need one more thing. There's one other thing that I want you to make friends with, and that's だ (da). 'Sakura ga Nihonjin da': 'Sakura is a Japanese person'. Now, you may have met this da in its fancy form, desu, but there are very good reasons for learning the plain, simple form first. So we're going to learn da. Now if you look at da, it's like an equals sign boxed off to the left. And this is a perfect mnemonic for what it does, because da tells us that A is B. Why is it boxed off to the left? Because it only works one way. Think about this logically: Sakura ga Nihonjin da – Sakura = Japanese person. But it doesn't work the other way: Japanese people are Sakura – they're not all Sakura. Sakura is a Japanese person, but a Japanese person is not necessarily Sakura. So now we have an A is B sentence and an A does B sentence. There is one more form of the Japanese core sentence, for it has three forms. The third form is when we have a describing word, an adjective. In Japanese, describing words end with い (i), just as they often do in English: happy, sunny, cloudy, silly. In Japanese it's just the same: happy – ureshii; sad – kanashii; blue – aoi. Now, we don't have to learn all these, but we do need to know about Japanese adjectives ending in i because they make the third kind of sentence. So let's take an easy one: pen (that's a nice easy word because it means pen) – 'pen ga akai' – 'pen is red'. Now, you notice that we don't have a da on this sentence. Why is that? Because the i-adjective akai (red) – it doesn't mean red, it means is-red. The da function, the equals function, is built into those i-adjectives. So those are the three forms of Japanese sentence. They all start with the subject of the sentence, they're all connected with ga, and they can end in three ways: with a verb, which will end in u, with the copula, da, or with an i because the last word is an adjective. And now you know the basics of Japanese. And although this is very very basic, you already know some things that the textbooks never teach you, and you have already overcome one of the problems that makes Japanese get so complicated",
            "can_use_romaji": true,
            "knowledge_assumed": "Nothing",
            "vocab_table_extra_notes":"",
            "exercises": {
                "exercise_list": [
                    {
                        "type": "Sentence Construction",
                        "description": "Ask the learner to construct 3 sentences using the 'A does B' structure, 3 sentences using the 'A is B' structure, and 3 sentences using the 'A is adjective' structure. This will give them a chance to practice each type of sentence equally."
                    },
                    {
                        "type": "Sentence Translation",
                        "description": "Provide 5 simple sentences in English using the sampled words and ask the learner to translate them into Japanese using the A does B and A is B structures."
                    },
                    {
                        "type": "Sentence Type Identification",
                        "description": "Provide a set of 8 Japanese sentences and ask the learner to identify whether each sentence is either an A does B sentence, an A is B sentence, or an A is adjective sentence."
                    }
                ],
                "marking_comments": "If the user classes an 'A is adjective' sentence as an 'A is B' sentence, mark it as incorrect but explain that it is strictly speaking they are correct, it's a subtype of A is B. They just need to show understanding that the 'i' in 'i-adjectives' carries the 'is' function, which is why 'da' is not needed in these sentences."
            },
            "bonus_lessons": []
        },
        "80001": {
            "video_link": "",
            "lecture_name" : "",
            "lecture_summary" : "",
            "lecture_text": "",
            "can_use_romaji": false,
            "knowledge_assumed": "",
            "vocab_table_extra_notes":"",
            "exercises": {
                "instructions": "",
                "exercise_list": [
                    {
                        "type": "",
                        "description": ""
                    },
                    {
                        "type": "",
                        "description": ""
                    },
                    {
                        "type": "",
                        "description": ""
                    }
                ],
                "marking_comments": ""
            },
            "bonus_lessons": []
        }
    }
}
