{
    "lessons": {
        "1": {
            "video_link": "https://www.youtube.com/watch?v=pSvH9vH60Ig",
            "lecture_name" : "The Core Japanese sentence",
            "lecture_summary" : "How to make A is B and A does B sentences.",
            "lecture_text": "The most basic thing about Japanese is the Japanese core sentence. Every Japanese sentence is fundamentally the same. It has the same core. What does it look like? We're going to picture it as a train. Every Japanese sentence has these two elements: A and B. The main carriage and the engine. The engine is what makes the sentence move, what makes it work. The carriage has to be there because without the carriage there's nothing for the engine to move. Those two things are the core of every Japanese sentence. And if you can understand this, you can understand every sentence, no matter how complicated it becomes. Later on we'll have a lot more carriages. We can say more about A; we can say more about B; we can combine logical sentences together to make complex sentences. But every Japanese sentence conforms to this basic type. So, what are A and B? Let's begin by reminding ourselves that in any language whatever there are only two kinds of sentence. And they are A is B sentences and A does B sentences. So an A does B sentence is 'Sakura walks'. An A is B sentence is 'Sakura is Japanese'. And we can put these into the past tense; we can put them in the negative; we can turn them into questions; we can say more about A; we can say more about B. But, ultimately, every sentence boils down to one of these: an A is B or an A does B sentence. So let's look at how we do this in Japanese. In Japanese, if we want to say 'Sakura walks' (A does B: Sakura walks), then A is Sakura, the main carriage, and B is walks, the thing she does, the engine of the sentence. Walk in Japanese is 'aruku'. And we need one more thing to make the core Japanese sentence. And that is the linchpin of every sentence, and it's が (ga). Make friends with ga, it's the center of Japanese grammar. Every Japanese sentence revolves around ga. Part of the reason that Japanese gets so confusing the way it's taught in the textbooks is that they don't properly explain this. In some sentences we're not going to be able to see the ga, but it's always there, and it's always doing the same job. That may sound a little complicated, but it isn't. It's very simple, and I'm going to explain that in the next lesson. For now, let's just stick with the very simplest kind of sentence. So here is ga. It looks like a post with a big hook on it, doesn't it? It links together A and B and turns them into a sentence. So, our core A does B sentence is 'Sakura ga aruku': 'Sakura walks'. Now let's take an A is B sentence: 'Sakura is Japanese', or, as we say, 'Sakura is a Japanese person'. So, A again is Sakura, B is Nihonjin, which means Japanese person, and once again we need ga to link them together. So we're going to picture the A car, the main carriage, with a ga on it, because the main carriage, the subject of the sentence, aways carries a ga, to link it to the engine. So Sakura ga Nihonjin – and we need one more thing. There's one other thing that I want you to make friends with, and that's だ (da). 'Sakura ga Nihonjin da': 'Sakura is a Japanese person'. Now, you may have met this da in its fancy form, desu, but there are very good reasons for learning the plain, simple form first. So we're going to learn da. Now if you look at da, it's like an equals sign boxed off to the left. And this is a perfect mnemonic for what it does, because da tells us that A is B. Why is it boxed off to the left? Because it only works one way. Think about this logically: Sakura ga Nihonjin da – Sakura = Japanese person. But it doesn't work the other way: Japanese people are Sakura – they're not all Sakura. Sakura is a Japanese person, but a Japanese person is not necessarily Sakura. So now we have an A is B sentence and an A does B sentence. There is one more form of the Japanese core sentence, for it has three forms. The third form is when we have a describing word, an adjective. In Japanese, describing words end with い (i), just as they often do in English: happy, sunny, cloudy, silly. In Japanese it's just the same: happy – ureshii; sad – kanashii; blue – aoi. Now, we don't have to learn all these, but we do need to know about Japanese adjectives ending in i because they make the third kind of sentence. So let's take an easy one: pen (that's a nice easy word because it means pen) – 'pen ga akai' – 'pen is red'. Now, you notice that we don't have a da on this sentence. Why is that? Because the i-adjective akai (red) – it doesn't mean red, it means is-red. The da function, the equals function, is built into those i-adjectives. So those are the three forms of Japanese sentence. They all start with the subject of the sentence, they're all connected with ga, and they can end in three ways: with a verb, which will end in u, with the copula, da, or with an i because the last word is an adjective. And now you know the basics of Japanese. And although this is very very basic, you already know some things that the textbooks never teach you, and you have already overcome one of the problems that makes Japanese get so complicated",
            "can_use_romaji": true,
            "knowledge_assumed": "Nothing",
            "vocab_table_extra_notes":"",
            "exercises": {
                "exercise_list": [
                    {
                        "type": "Sentence Construction",
                        "description": "Ask the learner to construct 3 sentences using the 'A does B' structure, 3 sentences using the 'A is B' structure, and 3 sentences using the 'A is adjective' structure. This will give them a chance to practice each type of sentence equally."
                    },
                    {
                        "type": "Sentence Translation",
                        "description": "Provide 5 simple sentences in English using the sampled words and ask the learner to translate them into Japanese using the A does B and A is B structures."
                    },
                    {
                        "type": "Sentence Type Identification",
                        "description": "Provide a set of 8 Japanese sentences and ask the learner to identify whether each sentence is either an A does B sentence, an A is B sentence, or an A is adjective sentence."
                    }
                ],
                "marking_comments": "If the user classes an 'A is adjective' sentence as an 'A is B' sentence, mark it as incorrect but explain that it is strictly speaking they are correct, it's a subtype of A is B. They just need to show understanding that the 'i' in 'i-adjectives' carries the 'is' function, which is why 'da' is not needed in these sentences."
            },
            "bonus_lessons": []
        },
        "2": {
            "video_link": "https://www.youtube.com/watch?v=P3n8n0u3LHA",
            "lecture_name" : "Core Secrets",
            "lecture_summary" : "Use of implied subjects and the use of the を particle",
            "lecture_text": "Last week, we learned how every Japanese sentence has the same core. The main carriage and the engine: The thing we are talking about (A) and the thing we are saying about it (B). And I told you that we can have a lot more carriages as sentences become more complex, but they still always have the same core. Now we are going to look at some of those extra carriages. And the first one we're going to look at is a very mysterious carriage, but it's also a very important one. Part of the reason that so many people find Japanese confusing, vague and difficult isbecause they are never properly taught about this carriage. What does it look like? Well, I told you before that while every sentence has the same two core elements, you can't always see both of them. You can always see the engine, but sometimes you can't see the main carriage. Why not? When you can't see it, it's because of this: the invisible carriage. While you can't see it, it's always there, and understanding that it's always there is the key to understanding Japanese. So, what is the invisible carriage? In English, the closest equivalent is 'it'. Let's begin by seeing what 'it' does in English. Take this sentence: 'The ball rolled down the hill. When the ball got to the bottom, the ball hit a sharp stone. The ball was punctured and all the air came out of the ball.' Now, would anybody ever say that? Of course they wouldn't, because once we have established what we are talking about, we replace it with 'it'. So we say, 'The ball rolled down the hill. When it got to the bottom, it hit a sharp stone. It was punctured and all the air came out of it.' Now, let's suppose a small child tries to say this and says, 'Ball rolled down hill,got to bottom, hit sharp stone, got punctured, all the air came out.' Now, is that difficult to understand? No, because in fact we don't need to use this 'it' marker every time, over and over again. English grammar demands it, but there's no actual communicative need to do it. And Japanese doesn't do 'it'. In place of 'it' – which actually means nothing because it can mean anything. If I say 'it', I may be talking about a flower or about the sky or the Eiffel Tower or the Andomeda galaxy. 'It' in itself doesn't mean anything: you know what 'it' is from context.So, if a small child, or even an adult, comes down to the kitchen at night and someone sees her,  she might say,'Got really hungry. Came for something to eat.'Again, there's nothing confusing or difficult about this. She means, 'I got really hungry. I came down for something to eat.'In English this isn't a proper sentence, but in Japanese it is.All those little pronouns, like 'it', 'she', 'he', 'I', 'they', in Japanese can be replaced by the invisible carriage, the zero pronoun. But the important thing to remember is that they are still there. All right. Let's look at this at work in Japanese. I might say, 'Dolly da', and that means 'I am Dolly'. So the full sentence is, 'zero-ga Dolly da'. So this looks as if it only has an engine and no main carriage, but the main carriage is simply the invisible one. And we can say that 'I' is the default value of the zero pronoun, the invisible carriage. However, the context can define it as anything. For example, if we hear a rustling in the woods and look over in the direction of it,and I say, 'usagi da!' that means 'zero ga usagi da!''It is a rabbit!'It, that thing we just looked toward, rustling in the trees, that's a rabbit.If I say, 'doyoubi da' (doyoubi means Saturday), I'm saying 'It is Saturday'. What's 'it'? Today – 'Today is Saturday' – 'It is Saturday'. All these sentences are full, complete Japanese sentences, with the ga-marked subject,the A carriage, the main carriage, and the engine.But in each of these cases, the main carriage is invisible – but it's still there. Now, it may seem a little bit like splitting hairs to insist that it isn't being left out, it actually is there.But it's important to understand this. It's important at this stage, but it will become much more important as sentences become more complex. Without this piece of information, they're going to start sounding extremely vague and hard to grasp. So now, let's start looking step-by-step at how sentences can become more complex.And then let's see how it all fits together at this stage. I'm going to introduce you to one more kind of carriage and that is an を car. This means a noun marked by the particle を. It is sometimes said 'wo' and more usually just 'o'. And if you know the English grammatical term 'object', which means the thing we're doing something to, it's a good mnemonic to remember that 'o' stands for 'object'.So the を car looks like this, and as you see, it's white. It's white because it's not part of the core train. The core train always consists of just two elements, the engine and the main carriage. When we see white cars, we know that they're telling us something more about the engine or about the main carriage. So let's take a sentence here: 'watashi-ga keeki-wo taberu'. This means 'I eat cake'. Now, the core sentence here is 'I eat'. Those are the two black carriages. The white carriage, 'keeki-wo', is telling us more about the engine. The core sentence is 'I eat' and 'keeki-wo' is telling us what it is that I eat. Now, the interesting thing here is that we may often see this said like this: 'keeki-wo taberu'. You already know what's going on when this happens: another case where we have the invisible A car. We can't have a sentence without a が, we can't have an action being done without a doer.If we say 'keeki-wo taberu', what we're really saying is 'zero-ga keeki-wo taberu'.And the default value for 'zero', for the invisible carriage, is 'watashi'.So usually this is going to be 'I eat cake', although if you were talking about someone else at the time, it might mean that that person eats cake.",
            "can_use_romaji": true,
            "knowledge_assumed": "Knows A (is/does) B structures, introduced to ga and da ",
            "vocab_table_extra_notes":"",
            "exercises": {
                "exercise_list": [
                    {
                        "type": "Sentence Construction",
                        "description": "Ask the learner to construct 5 basic sentences using the 'A does B' structure with the 'を' particle."
                    },
                    {
                        "type": "Invisible Carriage Identification",
                        "description": "Provide 5 of Japanese sentences and ask the learner to identify where the invisible carriage (zero pronoun) is implied. Give a little context, and provide a few different options where the implied subject is different, the answer to all of these shouldn't simply be 'me'."
                    }
                ],
                "marking_comments": ""
            },
            "bonus_lessons": []
        },
        "3": {
            "video_link": "https://www.youtube.com/watch?v=U9_T4eObNXg",
            "lecture_name" : "The wa-particle: How wa can make or break your Japanese",
            "lecture_summary" : "How the wa particle really works, and introducing the ni particle",
            "lecture_text": "Some of you who have done some Japanese already may be wondering how I've managed to get through two entire lessons without using or even mentioning the は (wa) particle. Most courses start you on wa from the beginning. 'Watashi wa Amerikajin da.' 'Pen wa aoi.' This is a very bad idea because it leaves you completely unclear about what the particles really do and about the logical structure of sentences. However, we're now ready to look at the wa particle and find out what it does and, crucially, what it doesn't do. The wa particle can never be a part of the core sentence. It can never be one of the black carriages, the main car A (the thing we are saying something about) or the engine B (the thing we are saying about it). It can't be a white car either, because white cars like the を (wo) car, are part of the logical structure of the sentence. And a wa-marked noun is never part of the logical structure of a sentence. Wa is a non-logical particle. So if wa is not a black car or a white car, what kind of a carriage is it? Well, it's not a carriage at all. A wa-marked noun looks a flag. Why do we depict it as a flag? Because that is what wa does. It flags something as the topic of the sentence. It doesn't say anything about it. That's what the logical sentence is there for. Wa simply flags the topic. Now, textbooks will tell you that a sentence like 'watashi wa Amerikajin da' literally means 'As for me, I am an American', and that is exactly correct. If they would stick with that logic and carry it through, we wouldn't have trouble. So, 'watashi wa' means 'as for me'. 'Amerikajin da' means 'American' or 'am American'. With a sentence like this something is missing, both from the Japanese and the English. We can't say 'as for me, am American'. Neither can we have a sentence without an A car, without a ga-marked doer. So if we put the A car in, it makes sense in both English and Japanese. 'Watashi-wa zero-ga Amerikajin da' – 'As for me, I am an American.' Now, some of you may be saying, 'Isn't it over-complicated? Can't we just pretend that 'watashi-wa' is the main car of the sentence?' And the answer to that is 'No'. Because although it works in this case and some other cases, it doesn't work in every case and that is why we really mustn't do it. For example, an old joke among Japanese learners is only possible because of how badly Japanese is taught. The joke is: A group of people are dining in a restaurant and they're discussing what they're going to eat, and somebody says, 'Watashi wa unagi da'. Unagi means eel, so the joke is that this person has literally said, 'I am an eel'. After all, if 'watashi wa Amerikajin da' means 'I am an American', then 'watashi wa unagi da' must mean 'I am an eel'. That's logical – except that 'watashi wa Amerikajin da' doesn't mean 'I am an American'. It means 'As for me, I am an American'. As we know, the default value of the invisible car, the zero pronoun, is 'watashi', but that isn't its only value. Its value depends on context. In 'watashi wa Amerikajin da' ('as for me, I am an American') the value of the zero pronoun is indeed 'watashi'. But in 'watashi wa unagi da', which is 'watashi wa zero-ga unagi da', zero is not 'watashi'. Zero is 'it'. 'It' is the thing we are talking about, the subject of the conversation: what we are eating for dinner. And this is going to affect all kinds of sentences as we become more advanced in Japanese. So what we are going to do now is take another one of the cars and look at that and then see how it all works together with wa. The car we're going to introduce today is a white car, and this is the に (ni) car. It makes a kind of trio with が (ga) and を (wo). In 'A does B' sentences, ga tells us who does the doing, wo tells us what it is done to, and ni tells us the ultimate target of that doing. Now, we don't always have a wo; we don't always have a ni. But let's take this wo sentence: 'Watashi-ga booru-wo nageru.' Booru is ball and nageru means throw. So this is, 'I throw a ball'. The core sentence is 'I throw' – 'watashi-ga nageru', and the white car tells us what I threw: it was a ball. Now, if we say, 'watashi ga booru-wo sakura-ni nageru', this means 'I throw a ball at Sakura' (or 'to Sakura'). Sakura is the destination, the target, of my throwing. And it's very important to note here that it is the logical particles – ga, wo and ni – that tell us what is happening. The order of the words doesn't really matter the way it does in English. What matters is the logical particle. So if I say, 'watashi-ni sakura-ga booru-wo nageru', I'm saying, 'Sakura throws the ball at me'. If I say, 'booru-ga watashi-ni sakura-wo nageru', I'm saying, 'The ball throws Sakura at me'. It doesn't make any sense, but we might want to say it in a fantasy novel or something. We can say whatever we like in Japanese so long as we have the logic of the particles correct. But now let's introduce wa into this sentence. 'Watashi-wa sakura-ni booru-wo nageru.' This is 'watashi-wa zero-ga sakura-ni booru-wo nageru'. As we know, what it means is 'As for me, I throw the ball at Sakura'. Now let's give the wa to the ball: 'Booru-wa watashi-ga sakura-ni nageru.' What we are saying now is 'As for the ball, I throw it at Sakura'. The important thing to notice here is that when we change a logical particle from one noun to another we change what's actually happening in the sentence, but when we change the non-logical particle wa from one noun to another – I can change it from me to the ball – it makes no difference to the logic of the sentence. It makes a difference to the emphasis: I'm now talking about the ball, 'as for the ball...' What happens to the ball is that I throw it at Sakura, but who is doing what, and what they are doing it with and what they are doing it to, none of that changes when you change the wa particle and that's the difference between a logical and a non-logical particle. ",
            "can_use_romaji": true,
            "knowledge_assumed": "Knows A (is/does) B structures. Some experience with the da, ga, and wo particle. They know of the train metaphor:  the (sometimes implied and invisible or 'zero-ga') 'main carriage' ('A car': subject) and 'engine' ('B car': verb or predicate) form the core elements: 'black carriages'. Additional details or context, like objects or modifiers, are 'white carriages'.",
            "vocab_table_extra_notes":"",
            "exercises": {
                "exercise_list": [
                    {
                        "type": "Sentence Context Identification",
                        "description": "Present the learner with 5 Japanese sentences and their contexts. The learner is then tasked to determine whether each sentence aligns more with the context of 'Watashi wa Amerikajin da' ('As for me, I am American') or 'Watashi wa unagi da' ('As for me, the subject is eel'). Include an equal mix of both sentence types to verify their grasp of the subtleties dependent on context."
                    },
                    {
                        "type": "Choosing は or が",
                        "description": "Provide 6 Japanese sentences with a missing particle and ask the learner to fill in the blank with either 'は' (wa) or 'が' (ga), based on the context and what they've learned about these particles"
                    },
                    {
                        "type": "Sentence Translation",
                        "description": "Provide 5 simple sentences in English, careful to ensure that the vocab used is in the vocab tables, and ask the learner to translate them into Japanese using the 'A does B' structure with the 'を' , 'が', and 'に' particles, and also using the 'は' (wa) particle to flag the topic of the sentence. After completing this exercise, let the learner review the correct translations and explanations"
                    },
                    {
                        "type": "Sentence Construction",
                        "description": "Ask the learner to construct 5 basic sentences using the 'A does B' structure with the 'を' (wo), 'が' (ga), and 'に' (ni) particles, and also using the 'は' (wa) particle to flag the topic of the sentence"
                    }
                ],
                "marking_comments": ""
            },
            "bonus_lessons": []
        }
    }
}
