{
    "lessons": {
        "1": {
            "video_link": "https://www.youtube.com/watch?v=pSvH9vH60Ig",
            "lecture_name" : "The Core Japanese sentence",
            "lecture_summary" : "How to make A is B and A does B sentences.",
            "lecture_text": "The most basic thing about Japanese is the Japanese core sentence. Every Japanese sentence is fundamentally the same. It has the same core. What does it look like? We're going to picture it as a train. Every Japanese sentence has these two elements: A and B. The main carriage and the engine. The engine is what makes the sentence move, what makes it work. The carriage has to be there because without the carriage there's nothing for the engine to move. Those two things are the core of every Japanese sentence. And if you can understand this, you can understand every sentence, no matter how complicated it becomes. Later on we'll have a lot more carriages. We can say more about A; we can say more about B; we can combine logical sentences together to make complex sentences. But every Japanese sentence conforms to this basic type. So, what are A and B? Let's begin by reminding ourselves that in any language whatever there are only two kinds of sentence. And they are A is B sentences and A does B sentences. So an A does B sentence is 'Sakura walks'. An A is B sentence is 'Sakura is Japanese'. And we can put these into the past tense; we can put them in the negative; we can turn them into questions; we can say more about A; we can say more about B. But, ultimately, every sentence boils down to one of these: an A is B or an A does B sentence. So let's look at how we do this in Japanese. In Japanese, if we want to say 'Sakura walks' (A does B: Sakura walks), then A is Sakura, the main carriage, and B is walks, the thing she does, the engine of the sentence. Walk in Japanese is 'aruku'. And we need one more thing to make the core Japanese sentence. And that is the linchpin of every sentence, and it's が (ga). Make friends with ga, it's the center of Japanese grammar. Every Japanese sentence revolves around ga. Part of the reason that Japanese gets so confusing the way it's taught in the textbooks is that they don't properly explain this. In some sentences we're not going to be able to see the ga, but it's always there, and it's always doing the same job. That may sound a little complicated, but it isn't. It's very simple, and I'm going to explain that in the next lesson. For now, let's just stick with the very simplest kind of sentence. So here is ga. It looks like a post with a big hook on it, doesn't it? It links together A and B and turns them into a sentence. So, our core A does B sentence is 'Sakura ga aruku': 'Sakura walks'. Now let's take an A is B sentence: 'Sakura is Japanese', or, as we say, 'Sakura is a Japanese person'. So, A again is Sakura, B is Nihonjin, which means Japanese person, and once again we need ga to link them together. So we're going to picture the A car, the main carriage, with a ga on it, because the main carriage, the subject of the sentence, aways carries a ga, to link it to the engine. So Sakura ga Nihonjin – and we need one more thing. There's one other thing that I want you to make friends with, and that's だ (da). 'Sakura ga Nihonjin da': 'Sakura is a Japanese person'. Now, you may have met this da in its fancy form, desu, but there are very good reasons for learning the plain, simple form first. So we're going to learn da. Now if you look at da, it's like an equals sign boxed off to the left. And this is a perfect mnemonic for what it does, because da tells us that A is B. Why is it boxed off to the left? Because it only works one way. Think about this logically: Sakura ga Nihonjin da – Sakura = Japanese person. But it doesn't work the other way: Japanese people are Sakura – they're not all Sakura. Sakura is a Japanese person, but a Japanese person is not necessarily Sakura. So now we have an A is B sentence and an A does B sentence. There is one more form of the Japanese core sentence, for it has three forms. The third form is when we have a describing word, an adjective. In Japanese, describing words end with い (i), just as they often do in English: happy, sunny, cloudy, silly. In Japanese it's just the same: happy – ureshii; sad – kanashii; blue – aoi. Now, we don't have to learn all these, but we do need to know about Japanese adjectives ending in i because they make the third kind of sentence. So let's take an easy one: pen (that's a nice easy word because it means pen) – 'pen ga akai' – 'pen is red'. Now, you notice that we don't have a da on this sentence. Why is that? Because the i-adjective akai (red) – it doesn't mean red, it means is-red. The da function, the equals function, is built into those i-adjectives. So those are the three forms of Japanese sentence. They all start with the subject of the sentence, they're all connected with ga, and they can end in three ways: with a verb, which will end in u, with the copula, da, or with an i because the last word is an adjective. And now you know the basics of Japanese. And although this is very very basic, you already know some things that the textbooks never teach you, and you have already overcome one of the problems that makes Japanese get so complicated",
            "can_use_romaji": true,
            "knowledge_assumed": "Nothing",
            "vocab_table_extra_notes":"",
            "exercises": {
                "exercise_list": [
                    {
                        "type": "Sentence Construction",
                        "description": "Ask the learner to construct 3 sentences using the 'A does B' structure, 3 sentences using the 'A is B' structure, and 3 sentences using the 'A is adjective' structure. This will give them a chance to practice each type of sentence equally."
                    },
                    {
                        "type": "Sentence Translation",
                        "description": "Provide 5 simple sentences in English using the sampled words and ask the learner to translate them into Japanese using the A does B and A is B structures."
                    },
                    {
                        "type": "Sentence Type Identification",
                        "description": "Provide a set of 8 Japanese sentences and ask the learner to identify whether each sentence is either an A does B sentence, an A is B sentence, or an A is adjective sentence."
                    }
                ],
                "marking_comments": "If the user classes an 'A is adjective' sentence as an 'A is B' sentence, mark it as incorrect but explain that it is strictly speaking they are correct, it's a subtype of A is B. They just need to show understanding that the 'i' in 'i-adjectives' carries the 'is' function, which is why 'da' is not needed in these sentences."
            },
            "bonus_lessons": []
        },
        "2": {
            "video_link": "https://www.youtube.com/watch?v=P3n8n0u3LHA",
            "lecture_name" : "Core Secrets",
            "lecture_summary" : "Use of implied subjects and the use of the を particle",
            "lecture_text": "Last week, we learned how every Japanese sentence has the same core. The main carriage and the engine: The thing we are talking about (A) and the thing we are saying about it (B). And I told you that we can have a lot more carriages as sentences become more complex, but they still always have the same core. Now we are going to look at some of those extra carriages. And the first one we're going to look at is a very mysterious carriage, but it's also a very important one. Part of the reason that so many people find Japanese confusing, vague and difficult isbecause they are never properly taught about this carriage. What does it look like? Well, I told you before that while every sentence has the same two core elements, you can't always see both of them. You can always see the engine, but sometimes you can't see the main carriage. Why not? When you can't see it, it's because of this: the invisible carriage. While you can't see it, it's always there, and understanding that it's always there is the key to understanding Japanese. So, what is the invisible carriage? In English, the closest equivalent is 'it'. Let's begin by seeing what 'it' does in English. Take this sentence: 'The ball rolled down the hill. When the ball got to the bottom, the ball hit a sharp stone. The ball was punctured and all the air came out of the ball.' Now, would anybody ever say that? Of course they wouldn't, because once we have established what we are talking about, we replace it with 'it'. So we say, 'The ball rolled down the hill. When it got to the bottom, it hit a sharp stone. It was punctured and all the air came out of it.' Now, let's suppose a small child tries to say this and says, 'Ball rolled down hill,got to bottom, hit sharp stone, got punctured, all the air came out.' Now, is that difficult to understand? No, because in fact we don't need to use this 'it' marker every time, over and over again. English grammar demands it, but there's no actual communicative need to do it. And Japanese doesn't do 'it'. In place of 'it' – which actually means nothing because it can mean anything. If I say 'it', I may be talking about a flower or about the sky or the Eiffel Tower or the Andomeda galaxy. 'It' in itself doesn't mean anything: you know what 'it' is from context.So, if a small child, or even an adult, comes down to the kitchen at night and someone sees her,  she might say,'Got really hungry. Came for something to eat.'Again, there's nothing confusing or difficult about this. She means, 'I got really hungry. I came down for something to eat.'In English this isn't a proper sentence, but in Japanese it is.All those little pronouns, like 'it', 'she', 'he', 'I', 'they', in Japanese can be replaced by the invisible carriage, the zero pronoun. But the important thing to remember is that they are still there. All right. Let's look at this at work in Japanese. I might say, 'Dolly da', and that means 'I am Dolly'. So the full sentence is, 'zero-ga Dolly da'. So this looks as if it only has an engine and no main carriage, but the main carriage is simply the invisible one. And we can say that 'I' is the default value of the zero pronoun, the invisible carriage. However, the context can define it as anything. For example, if we hear a rustling in the woods and look over in the direction of it,and I say, 'usagi da!' that means 'zero ga usagi da!''It is a rabbit!'It, that thing we just looked toward, rustling in the trees, that's a rabbit.If I say, 'doyoubi da' (doyoubi means Saturday), I'm saying 'It is Saturday'. What's 'it'? Today – 'Today is Saturday' – 'It is Saturday'. All these sentences are full, complete Japanese sentences, with the ga-marked subject,the A carriage, the main carriage, and the engine.But in each of these cases, the main carriage is invisible – but it's still there. Now, it may seem a little bit like splitting hairs to insist that it isn't being left out, it actually is there.But it's important to understand this. It's important at this stage, but it will become much more important as sentences become more complex. Without this piece of information, they're going to start sounding extremely vague and hard to grasp. So now, let's start looking step-by-step at how sentences can become more complex.And then let's see how it all fits together at this stage. I'm going to introduce you to one more kind of carriage and that is an を car. This means a noun marked by the particle を. It is sometimes said 'wo' and more usually just 'o'. And if you know the English grammatical term 'object', which means the thing we're doing something to, it's a good mnemonic to remember that 'o' stands for 'object'.So the を car looks like this, and as you see, it's white. It's white because it's not part of the core train. The core train always consists of just two elements, the engine and the main carriage. When we see white cars, we know that they're telling us something more about the engine or about the main carriage. So let's take a sentence here: 'watashi-ga keeki-wo taberu'. This means 'I eat cake'. Now, the core sentence here is 'I eat'. Those are the two black carriages. The white carriage, 'keeki-wo', is telling us more about the engine. The core sentence is 'I eat' and 'keeki-wo' is telling us what it is that I eat. Now, the interesting thing here is that we may often see this said like this: 'keeki-wo taberu'. You already know what's going on when this happens: another case where we have the invisible A car. We can't have a sentence without a が, we can't have an action being done without a doer.If we say 'keeki-wo taberu', what we're really saying is 'zero-ga keeki-wo taberu'.And the default value for 'zero', for the invisible carriage, is 'watashi'.So usually this is going to be 'I eat cake', although if you were talking about someone else at the time, it might mean that that person eats cake.",
            "can_use_romaji": true,
            "knowledge_assumed": "Knows A (is/does) B structures, introduced to ga and da ",
            "vocab_table_extra_notes":"",
            "exercises": {
                "exercise_list": [
                    {
                        "type": "Sentence Construction",
                        "description": "Ask the learner to construct 5 basic sentences using the 'A does B' structure with the 'を' particle."
                    },
                    {
                        "type": "Invisible Carriage Identification",
                        "description": "Provide 5 of Japanese sentences and ask the learner to identify where the invisible carriage (zero pronoun) is implied. Give a little context, and provide a few different options where the implied subject is different, the answer to all of these shouldn't simply be 'me'."
                    }
                ],
                "marking_comments": ""
            },
            "bonus_lessons": []
        },
        "3": {
            "video_link": "https://www.youtube.com/watch?v=U9_T4eObNXg",
            "lecture_name" : "The wa-particle: How wa can make or break your Japanese",
            "lecture_summary" : "How the wa particle really works, and introducing the ni particle",
            "lecture_text": "Some of you who have done some Japanese already may be wondering how I've managed to get through two entire lessons without using or even mentioning the は (wa) particle. Most courses start you on wa from the beginning. 'Watashi wa Amerikajin da.' 'Pen wa aoi.' This is a very bad idea because it leaves you completely unclear about what the particles really do and about the logical structure of sentences. However, we're now ready to look at the wa particle and find out what it does and, crucially, what it doesn't do. The wa particle can never be a part of the core sentence. It can never be one of the black carriages, the main car A (the thing we are saying something about) or the engine B (the thing we are saying about it). It can't be a white car either, because white cars like the を (wo) car, are part of the logical structure of the sentence. And a wa-marked noun is never part of the logical structure of a sentence. Wa is a non-logical particle. So if wa is not a black car or a white car, what kind of a carriage is it? Well, it's not a carriage at all. A wa-marked noun looks a flag. Why do we depict it as a flag? Because that is what wa does. It flags something as the topic of the sentence. It doesn't say anything about it. That's what the logical sentence is there for. Wa simply flags the topic. Now, textbooks will tell you that a sentence like 'watashi wa Amerikajin da' literally means 'As for me, I am an American', and that is exactly correct. If they would stick with that logic and carry it through, we wouldn't have trouble. So, 'watashi wa' means 'as for me'. 'Amerikajin da' means 'American' or 'am American'. With a sentence like this something is missing, both from the Japanese and the English. We can't say 'as for me, am American'. Neither can we have a sentence without an A car, without a ga-marked doer. So if we put the A car in, it makes sense in both English and Japanese. 'Watashi-wa zero-ga Amerikajin da' – 'As for me, I am an American.' Now, some of you may be saying, 'Isn't it over-complicated? Can't we just pretend that 'watashi-wa' is the main car of the sentence?' And the answer to that is 'No'. Because although it works in this case and some other cases, it doesn't work in every case and that is why we really mustn't do it. For example, an old joke among Japanese learners is only possible because of how badly Japanese is taught. The joke is: A group of people are dining in a restaurant and they're discussing what they're going to eat, and somebody says, 'Watashi wa unagi da'. Unagi means eel, so the joke is that this person has literally said, 'I am an eel'. After all, if 'watashi wa Amerikajin da' means 'I am an American', then 'watashi wa unagi da' must mean 'I am an eel'. That's logical – except that 'watashi wa Amerikajin da' doesn't mean 'I am an American'. It means 'As for me, I am an American'. As we know, the default value of the invisible car, the zero pronoun, is 'watashi', but that isn't its only value. Its value depends on context. In 'watashi wa Amerikajin da' ('as for me, I am an American') the value of the zero pronoun is indeed 'watashi'. But in 'watashi wa unagi da', which is 'watashi wa zero-ga unagi da', zero is not 'watashi'. Zero is 'it'. 'It' is the thing we are talking about, the subject of the conversation: what we are eating for dinner. And this is going to affect all kinds of sentences as we become more advanced in Japanese. So what we are going to do now is take another one of the cars and look at that and then see how it all works together with wa. The car we're going to introduce today is a white car, and this is the に (ni) car. It makes a kind of trio with が (ga) and を (wo). In 'A does B' sentences, ga tells us who does the doing, wo tells us what it is done to, and ni tells us the ultimate target of that doing. Now, we don't always have a wo; we don't always have a ni. But let's take this wo sentence: 'Watashi-ga booru-wo nageru.' Booru is ball and nageru means throw. So this is, 'I throw a ball'. The core sentence is 'I throw' – 'watashi-ga nageru', and the white car tells us what I threw: it was a ball. Now, if we say, 'watashi ga booru-wo sakura-ni nageru', this means 'I throw a ball at Sakura' (or 'to Sakura'). Sakura is the destination, the target, of my throwing. And it's very important to note here that it is the logical particles – ga, wo and ni – that tell us what is happening. The order of the words doesn't really matter the way it does in English. What matters is the logical particle. So if I say, 'watashi-ni sakura-ga booru-wo nageru', I'm saying, 'Sakura throws the ball at me'. If I say, 'booru-ga watashi-ni sakura-wo nageru', I'm saying, 'The ball throws Sakura at me'. It doesn't make any sense, but we might want to say it in a fantasy novel or something. We can say whatever we like in Japanese so long as we have the logic of the particles correct. But now let's introduce wa into this sentence. 'Watashi-wa sakura-ni booru-wo nageru.' This is 'watashi-wa zero-ga sakura-ni booru-wo nageru'. As we know, what it means is 'As for me, I throw the ball at Sakura'. Now let's give the wa to the ball: 'Booru-wa watashi-ga sakura-ni nageru.' What we are saying now is 'As for the ball, I throw it at Sakura'. The important thing to notice here is that when we change a logical particle from one noun to another we change what's actually happening in the sentence, but when we change the non-logical particle wa from one noun to another – I can change it from me to the ball – it makes no difference to the logic of the sentence. It makes a difference to the emphasis: I'm now talking about the ball, 'as for the ball...' What happens to the ball is that I throw it at Sakura, but who is doing what, and what they are doing it with and what they are doing it to, none of that changes when you change the wa particle and that's the difference between a logical and a non-logical particle. ",
            "can_use_romaji": true,
            "knowledge_assumed": "Knows A (is/does) B structures. Some experience with the da, ga, and wo particles. They know of the train metaphor:  the (sometimes implied and invisible or 'zero-ga') 'main carriage' ('A car': subject) and 'engine' ('B car': verb or predicate) form the core elements: 'black carriages'. Additional details or context, like objects or modifiers, are 'white carriages'.",
            "vocab_table_extra_notes":"",
            "exercises": {
                "exercise_list": [
                    {
                        "type": "Sentence Context Identification",
                        "description": "Present the learner with 5 Japanese sentences and their contexts. The learner is then tasked to determine whether each sentence aligns more with the context of 'Watashi wa Amerikajin da' ('As for me, I am American') or 'Watashi wa unagi da' ('As for me, the subject is eel'). Include an equal mix of both sentence types to verify their grasp of the subtleties dependent on context."
                    },
                    {
                        "type": "Choosing は or が",
                        "description": "Provide 6 Japanese sentences with a missing particle and ask the learner to fill in the blank with either 'は' (wa) or 'が' (ga), based on the context and what they've learned about these particles"
                    },
                    {
                        "type": "Sentence Translation",
                        "description": "Provide 5 simple sentences in English, careful to ensure that the vocab used is in the vocab tables, and ask the learner to translate them into Japanese using the 'A does B' structure with the 'を' , 'が', and 'に' particles, and also using the 'は' (wa) particle to flag the topic of the sentence. After completing this exercise, let the learner review the correct translations and explanations"
                    },
                    {
                        "type": "Sentence Construction",
                        "description": "Ask the learner to construct 5 basic sentences using the 'A does B' structure with the 'を' (wo), 'が' (ga), and 'に' (ni) particles, and also using the 'は' (wa) particle to flag the topic of the sentence"
                    }
                ],
                "marking_comments": ""
            },
            "bonus_lessons": []
        },
        "4": {
            "video_link": "https://www.youtube.com/watch?v=lU5rmrAORDY",
            "lecture_name" : "Japanese past, present, and future tense",
            "lecture_summary" : "Introducing the non-past, continuous present, and past tenses in Japanese. Introducing the iru helper verb. Also: Relative and absolute time expressions",
            "lecture_text": "Up to now, we've only been using one tense - the one represented by the plain dictionary form of verbs: taberu/eat; aruku/walk, and so forth. To use natural-sounding Japanese, we need three tenses. You might think they would be past, present and future, but in fact they're not. What we've been using up to now is not a present tense. It's the non-past tense. People think this is confusing. Why can't Japanese have a simple present tense like English instead of something vague and mysterious like a non-past tense? Well, actually it isn't confusing at all, and what makes it confusing is, for a change, not the fact that Japanese is taught in a strange way, but that English is taught in a strange way. The truth is that the Japanese non-past tense is very similar to the English non-past tense. What is the English non-past tense? Well, it is the plain dictionary form of English words: eat, walk, etc. Why do I call it a non-past tense? Take an example. Suppose you get a message on your keitai saying, 'I walked to the cafe and now I eat cafe and drink coffee'. What would you know about the person who sent that message? Well, you'd know that it was not a native English speaker, because no native English speaker says 'I eat cake and I drink coffee' when they mean 'I am eating cake and drinking coffee right now'. When so we say 'I eat cake'? Well, we might say it when we mean that we eat cake sometimes: 'I eat cake. I'm not one of these people who doesn't eat cake. I do eat cake. Whenever there's any cake around, I eat it. But that doesn't mean I'm eating cake right at this moment.' When else do we use the English non-past plain form of verbs? Well, sometimes we use them for future events: 'Next week I fly to Tokyo.' 'Next month I have an exam.' And sometimes we use them for something that's going on right now, but not mostly. For example, in a literary description: 'The sun sinks over the sea and a small happy robot runs across the beach.' But that isn't the way we use it most of the time in everyday speech, is it? So, the Japanese non-past tense is very similar in the way it functions to the English non-past tense. If you understand one you can pretty much understand the other. Most of the time, the Japanese non-past tense refers to future events. 'Inu-ga taberu' - 'The dog will-eat'; 'Sakura-ga aruku' - 'Sakura will-walk.' The way we've been using it up to now - 'Sakura walks' - is possible, but it isn't the most natural way. We've been using it that way because it was the only tense we knew. If we want to say something more natural, like 'Sakura is walking', what do we do? Well, what do we do in English? In English we say, don't we, 'Sakura IS walking'. We use the word 'to be'. You can 'BE walking'. 'Sakura IS walking'; 'We ARE walking.' Fortunately, in Japanese we don't have all these different forms of the word 'to be'. We use the same word every time, and the word is 'iru'. 'Iru' means 'be' in relation to animals and people, and to make this continuous present tense, we always use 'iru'. So, 'Sakura is walking' – 'Sakura-ga aruite iru'. 'Dog is eating' – 'Inu-ga tabete iru.' Now, let's notice that in a sentence like 'Inu-ga tabete iru,' we have something we haven't yet seen, and that's a white engine. A white engine is an element that could be an engine but in this case it's not the engine of this sentence. It's modifying, or telling us more about, one of the core elements of the sentence. So, the core of this sentence is 'inu-ga iru' - 'the dog is'. But the dog isn't just existing – the dog is doing something. And that white engine tells us what it is doing. It is 'eating'. And we're going to see this white engine structure over and over again as we go deeper into Japanese. And just as in English we don't say 'the dog is eat', we use a special form of the verb that goes along with the verb of being. So in English we say 'is walking', 'is eating'. In Japanese we say 'tabete iru', 'aruite iru'. Now, how do we form this 'te'-form, which is the form we use for making the continuous present? With a word like 'taberu', it's very easy indeed. All we have to do is take off the 'ru' and put 'te' in its place. The bad news is that with other verbs, we do have slightly different ways of attaching the 'te'. Apart from the plain ru-form, there are four other ways. The textbooks will say five, but in fact two of them are so similar that we can treat them as four. This will be the next lesson. It's important to watch that so that you can learn how to form the continuous present tense. The good news: it's perfectly regular. Once you know the ending of a verb you also know how to put the 'te' onto it. The only one that's a bit tricky is ru-ending verbs, but that will be expplained. How do we put things into the past tense? It's very easy indeed. All we do is add 'ta' – that's the whole thing. So, 'inu-ga taberu' – 'dog will-eat' / 'inu-ga tabeta' – 'dog ate'. There are different ways of attaching 'ta' to different kinds of verb, verbs with different endings, but the good news here is that they are exactly the same as the ways that you attach 'te'. So once you've learned the ways that 'te' attaches, you've also learned the ways that 'ta' attaches. After the next lecture, you'll be able to do both the continuous present and the past. Now, there's one more thing about time expressions that I think is useful to learn now. If we want to make it clear, when we say 'watashi-wa keeki-wo taberu', that we're talking about a future event, we can say 'ashita' (which means 'tomorrow') 'ashita keeki-wo taberu'. That's all we have to do: say 'tomorrow' before we say the rest of the sentence, just as in English. 'Tomorrow I'm going to eat cake' – 'ashita keeki-wo taberu'. Now, 'tomorrow' is what we call a 'relative time expression' because it's relative to today. Today is yesterday's tomorrow. And with all relative time expressions like that: yesterday, last week, next year, and so forth, times that are relative to the present time, we just do what we did then. We put the time expression at the beginning of the sentence and that puts that whole sentence into that time. However, when we have an 'absolute time expression', an expression that is not relative to the present, such as Tuesday or six o'clock, then we have to use 'ni'. Tuesday is 'kayoubi' and we may may say 'Kayoubi-ni keeki-wo taberu' – 'On Tuesday I will eat cake.' The important thing here is that it can seem a bit complicated to have to work out, 'Is the time absolute or relative?' And the good thing to know here is that it's not complicated at all, because it works exactly the same as English. In English, we say, 'Tomorrow I eat cake', 'Next week, I have an exam', and so forth, but when we use an absolute time expression we say, 'On Monday I will eat cake', 'At six o'clock I have an exam'; if we're talking about a month we say, 'In July I'm going to Tokyo'. Now, Japanese works in exactly the same way except that we don't have to remember when we're using 'on', when we're using 'at' and when we're using 'in'. In Japanese we use 'ni' every time. But in English when we need one of those little words, on, in or at, then we need 'ni' in Japanese. And when we don't, then we don't need 'ni' in Japanese. English and Japanese are identical in that respect. So rather than sitting down to work out 'Is this relative, or is this absolute?', just think whether you need an on, in or at in English, and if you do, you need 'ni' in Japanese. And if you don't, you don't need 'ni' in Japanese. It's really as simple as that.",
            "can_use_romaji": true,
            "knowledge_assumed": "Knows A (is/does) B structures. Some experience with the wa, ni, da, ga, and wo particles. They know of the train metaphor:  the (sometimes implied and invisible or 'zero-ga') 'main carriage' ('A car': subject) and 'engine' ('B car': verb or predicate) form the core elements: 'black carriages'. Additional details or context, like objects or modifiers, are 'white carriages'. The wa particle 'flags' a carriage as the topic of a sentence.",
            "vocab_table_extra_notes":"Include at least 4 ichidan verbs in the 'verbs' table",
            "exercises": {
                "exercise_list": [
                    {
                        "type": "Non-Past Tense Practice",
                        "description": "Provide the user with 5 very simple sentences in English that express habitual actions or general facts with words that are in the vocab table (e.g., 'Bird flies', 'Dog eats'), and then have them translate these sentences into Japanese using the non-past tense"
                    },
                    {
                        "type": "Ichidan Te-form and Ta-form Practice",
                        "description": "Provide the user with three ichidan verbs into both their て-form and た-form."
                    },
                    {
                        "type": "Time Expressions Practice",
                        "description": "Give the user 5 Japanese sentences which require a relative or absolute time expression and write in brackets the time expression. There should be at least 2 of each. If the time expression is absolute, they should remember to add the 'ni' particle. For example, '(Saturday) boku ga aruku' should be transformed into 'Doyoubi ni boku ga aruku'."
                    }
                ],
                "marking_comments": ""
            },
            "bonus_lessons": []
        },
        "5": {
            "video_link": "https://www.youtube.com/watch?v=GzEVLMDC8nw",
            "lecture_name" : "Japanese verb groups and the te-form. Verb groups 1, 2, 3 made easy",
            "lecture_summary" : "Japanese verb groups: ichidan, godan, and the two irregular verbs, along with -ta and -te endings for them.",
            "lecture_text": "Today we're going to talk about Japanese verb groups. Japanese verbs fall into three groups, these matter when we're going to make some change in the form of the verb. Because we do that pretty often, it's important to understand the three groups. The first group of Japanese verbs is called ichidan verbs or 'one-level' verbs. Some people call them 'ru-verbs', which is a very silly name. If you're going to call them anything like that, we should probably call them 'iru/eru verbs'. They are the simplest and most basic kind of verb. When we want to make any change, we always do it the same way. All we do is take the -ru off the end and put on whatever we want to put on. Ichidan verbs can only end with either -iru or -eru, that's to say, with one of the kana from the i-row or one of the kana from the e-row plus -ru. The second group of verbs is by far the largest and any ending that a verb can have, verbs in this group can have. Verbs always end with the u-sound, but not all u-kana can make the end of a verb, but a lot of them can and all of them can make godan verbs. They are called godan verbs, or 'five-level' verbs, for reasons that we'll see shortly, and as I say they can end in any u-sound, including -iru or -eru. Unlike ichidan verbs, they can also end in -oru, -aru or -uru. So the only time we have any ambiguity is when we have a verb ending in -iru or -eru. Most of those verbs are ichidan verbs, but there is a substantial minority of iru/eru-ending godan verbs. It's not as difficult to differentiate them as you might think, and I've made a video on that, although it's a little bit more advanced than this lesson. The third group of verbs is irregular verbs, and the good news here is that there are only two of them. Unlike the many that French or Spanish has, Japanese has just two. There are a couple of other verbs that are irregular in just one small respect, but very few. The irregular verbs are kuru (come) and suru (do). So now that we know the three groups, we're going to take a look at how you make them into the te- and ta-form. As I explained last week, we need those two forms for making the Japanese present and past tenses. And they have a number of other uses too, which we'll learn as we go along with this course. And as I demonstrated last week, ichidan verbs are always very easy. You never do anything except take off the -ru and put on whatever you're going to put on, in this case a te or a ta. As for the godan verbs, they fall into five groups. Godan verbs have five kinds of possible ending – that's why they're called godan verbs: five-level verbs. It's not that hard. We can combine two of the levels anyway, because they are so close that we only need to learn them once. And I'm going to go through the main groups. The first group is what I call the UTSURU verbs. Those are the verbs ending in -u, -tsu and -ru. The word utsuru in Japanese means to move from one thing to another, and that's exactly what we're doing here – moving our verbs from one type to another. So the verbs which end in -u, -tsu and -ru all transform in the same way to the te-form. We take off the -u, the -tsu or the -ru, and we replace it with a small -tsu plus te (or ta in the ta-form). So warau, laugh, becomes waratte; motsu, hold, becomes motte, and toru, take, becomes totte. Now, you'll notice that utsuru has tsu in the middle. And the te-form of the utsuru verbs is formed by using a small tsu plus that te. It's the only group that has tsu in it, and it's the only group that has a tsu in the te-form ending. So it's really easy to remember. The second group is what I call the NEW BOOM group. In Japanese when something is becoming popular, we call it a ブーム (BUUMU). Buumu, a New Buumu! So, this group I call the New Boom group and what I want you to notice about this group of verbs is that they all end in what I would call a dull sound – nu, mu, bu. It's not a sharp sound like su, tsu, ku, and it's not a neutral sound like ru or u. It's a dull sound – nu, bu, mu. And this is important because the ending is also a dull sound. The te-form ending is -nde, the ta-form is -nda. So shinu, the only -nu ending verb, becomes shinde / shinda; nomu, drink, becomes nonde / nonda; asobu, play, becomes asonde / asonda. So that's the New Boom group, the dull-ending verbs. And because only a limited number of the possible kana can be used as a verb ending, they include all the dull sounds except for gu. We'll come to that right now. I told you that two of the groups could be combined, and that is the ku and gu group. To make the te form of a -ku ending verb, we cut off the -ku and add -ite, or -ita in the ta form. So aruku, walk, becomes aruite / aruita. Now, if we have a ten-ten on that -ku, to make it into a -gu, it's exactly the same, except that there is also a ten-ten on the te-ending. So aruku becomes aruite, but oyogu, to swim, becomes oyoide. But, as you see, the two are more or less identical. It's just that if there's a ten-ten on the original verb, there's a ten-ten on the te-form too. Aruku, aruite; oyogu, oyoide. And now we just have one left, and that is su. And verbs ending in -su drop the -su and add -shite. As you will notice, if you have followed our last lesson, we are just doing that regular thing of shifting the su kana to its i-row equivalent, shi. So hanasu, talk, becomes hanashite; the masu helper verb, which turns verbs into formal verbs, in the past tense becomes mashita. So now we have all the go-dan verbs. Now, we are just going to look at the exceptions. There are only three altogether: our two irregular verbs and one other small one. And these are very simple. Kuru (come) become kite; suru (do) becomes shite. And iku – the verb iku (to go) – because it ends in -ku, you would expect it to become iite, but it doesn't, it becomes itte. And those are the only exceptions. ",
            "can_use_romaji": true,
            "knowledge_assumed": "Knows A (is/does) B structures. Familiar with the wa, ni, da, ga, and wo particles. Understands the meaning of 'te'-form and 'ta'-form and knows how to make them for ichidan verbs. Understands 'ni' use for absolute time expressions (e.g. On Saturday) and how to use relative time expressions (e.g. Tomorrow). They know of the train metaphor:  the (sometimes implied and invisible or 'zero-ga') 'main carriage' ('A car': subject) and 'engine' ('B car': verb or predicate) form the core elements: 'black carriages'. Additional details or context, like objects or modifiers, are 'white carriages'. The wa particle 'flags' a carriage as the topic of a sentence.",
            "vocab_table_extra_notes":"Only need verbs this time. Make a table for verbs of each group alongside their plain dictionary form. So we want a table with both irregular verbs, another table of 5 utsuru verbs, another table of 5 nubumu verbs, another table of 5 ichidan verbs, and another table of 5 kugu verbs",
            "exercises": {
                "exercise_list": [
                    {
                        "type": "-ta and -te endings",
                        "description": "Tell the user that this is the only exercise for this lesson. They need to take 3 verbs from each group, and convert them into their respective -ta and -te form. They should also do both irregular verbs."
                    }
                ],
                "marking_comments": ""
            },
            "bonus_lessons": []
        },
        "6": {
            "video_link": "https://www.youtube.com/watch?v=GzEVLMDC8nw",
            "lecture_name" : "Japanese Adjectives - the real secret that makes them easy",
            "lecture_summary" : "Deeper dive into adjective use, and learning the no and na particles",
            "lecture_text": "Today we are going to talk about adjectives. Now, Japanese adjectives are not the same thing as English adjectives. As we know, Japanese sentences come in three fundamental kinds, depending on the kind of engine they have. We have the U-Train, verb sentences; the DA-Train, noun sentences; and the I-Train, which is the so-called adjectival sentences. The U-Train is an A does B sentence, while the I and DA-Trains are A is B sentences. But the truth is that any one of the three kinds of engine can be used like an adjective. So let's start off with the most obvious one, the one that's called 'adjective' in English. A simple I-Train sentence is 'pen-ga akai'. As you know, 'akai' doesn't mean 'red', it means 'is-red'. Now, we can turn this black engine white and put it behind the pen. Now we have 'akai pen-ga'. 'Akai pen' means 'is-red pen' or, as we say in English, 'red pen'. As you see, this isn't a full sentence in itself any more because a white engine doesn't pull the train, it just tells us more about whatever it is sitting behind. So 'akai', once it becomes a white engine, is just telling us more about the main car of the sentence, which is 'pen'. And if we want to make it into a full sentence, we have to have a new engine. So, let's take 'chiisai', which means 'is-small'. 'Akai pen-ga chiisai' – 'The red pen is small'. So that's simple enough. Now let's look at verbs. Now, if you're worrying about na-adjectives, as they are called, don't worry. They are nouns, and we'll get to them in a minute. Any U-Engine, any verb, in any tense, can be used like an adjective. So, we can say, 'shoujo-ga utatta'. 'Utatta' means 'sang'. The word for sing is 'utau', so the ta-form, as we know from our last lesson, is 'utatta'. 'Shoujo-ga utatta' – 'The girl sang', and if we turn that engine white and put it behind the girl, we have 'utatta shoujo' – 'the girl who sang'. And of course, once again this isn't a sentence. But we can put in into any sentence we like, such as 'utatta shoujo-ga nete iru' – 'the girl who sang is sleeping'. And this is terribly important because a lot of Japanese is structured this way. We can use entire verb-sentences as adjectivals if we want to, and this happens very often. For example, 'inu-ga jisho-wo tabeta' – 'the dog ate the dictionary'. We can turn this around to 'jisho-wo tabeta inu' – 'the dog who ate the dictionary'. Or we can say, 'inu-ga tabeta jisho' – 'the dictionary that was eaten by the dog'. And then this can build into the full sentence, 'jisho-wo tabeta inu-ga yancha-da'. 'Yancha' is a noun that means 'naughty' or 'bad', so, 'the dog who ate the dictionary is bad'. This brings us to the noun-engine. If we just say 'inu-ga yancha-da', we have a simple noun sentence. But we can turn this engine as well into a white engine and put it behind the dog. But there is one change we have to make. When we turn 'da' or 'desu' into a white engine, when we connect it to anything, it changes its form from 'da' to 'na'. So we say 'inu-ga yancha-da', but we say 'yancha-na inu', which is the same as saying 'yancha-da inu' – 'is-bad dog / the dog that is bad / the bad dog'. So we can say 'yancha-na inu-ga nete iru' – 'the bad dog is sleeping'. Now, the important thing to note here is that you can't do this with every noun. There are only some nouns that are frequently used in an adjectival way, that you can use in the way we showed here. These are what the textbooks call 'na-adjectives', and it's a slightly confusing term, because as we see they are in fact nouns, but they are a certain class of noun. Can we use other nouns as adjectives? Yes, we can, but we use them in a somewhat different way and they aren't engines. To explain this we have to introduce a new type of car for our train. And this is the の car. の [no] is a very simple particle because it works exactly like apostrophe-s ['s] in English. So, 'Sakura no doresu' means 'Sakura's dress'. 'Watashi no hana' means 'my nose'. Luckily, we don't have to worry about things like 'my' and 'your' and 'her' and 'his' in Japanese; we always just use 'no'. Now, because 'no' is the possessive particle, it can be used in another, slightly different way. At the beginning of my older videos, I always used to say, 'KawaJapa no Kyua Dorii desu' – 'I am KawaJapa's Cure Dolly'. In other words, KawaJapa is the group or party or website that I belong to. And we can use this more widely for defining the group or class to which anything belongs. So, 'akai' means 'red' because we can turn the noun 'aka' into the adjectival form 'akai'. But we can't do that with all colors. For example, 'pinku-iro'. 'Iro' means 'color', and we say 'pinku-iro', that means 'pink'. But that doesn't have an i-form. And it doesn't count as an adjectival noun, a na-adjective, as they are called in English, either So what we do with it is, we use 'no'. 'Pinku-iro-no doresu' – 'pink dress'. And this means 'dress belonging to the class of pink things'. If we want to say 'Oscar the Rabbit', we say 'usagi-no Osukaru', which literally means 'rabbit's Oscar', and what it means is 'Oscar who belongs to the class 'rabbit' '. 'Zeruda-no densetsu' means 'the legend of Zelda'; 'densetsu-no senshi' means 'legendary warrior / warrior who belongs to the class of legendary things'. So we have four ways of forming adjectivals: the three engines plus the の car. And using this we can make all kinds of sentences and they can become very complex, especially with verbal adjectives in which we can use whole complex sentences in an adjectival manner. And I'm going to do some worksheets that will help us to get used to some of those more complex sentences and I'll put them in the information section below this video lesson. Now, one thing you may be thinking is, 'Since some nouns are used as adjectives with 'na' and some with 'no', do I have to start learning lists of which ones go with 'no' and which ones go with 'na'?' And my answer to that is, I don't see any good reason to do so unless you are having to learn them for an exam. Why not? Well, look at it logically. If you hear someone use them with either 'no' or 'na', you're going to know what they're saying. If you use them yourself and you get it wrong, nobody is going to have any difficulty understanding what you're saying, and it's a very small and typical foreigner's mistake, and frankly I think it's the least of your worries at an early stage. If you're writing, you can of course look them up very easily. As you use Japanese more, hear more Japanese, read more Japanese, you will pick up which ones are 'no' and which ones are 'na'. And if you're not going to use Japanese very much, well, why do you need to know? To me, Japanese isn't a game of learning abstract information for no particular reason. It's a language that for the most part we can learn in a natural manner, and understanding its real structure helps us very greatly to do that.",
            "can_use_romaji": true,
            "knowledge_assumed": "Knows A (is/does) B structures. Familiar with the wa, ni, da, ga, and wo particles. Understands the meaning of 'te'-form and 'ta'-form and knows how to make them for all types of verbs. Understands 'ni' use for absolute time expressions (e.g. On Saturday) and how to use relative time expressions (e.g. Tomorrow). They know of the train metaphor:  the (sometimes implied and invisible or 'zero-ga') 'main carriage' ('A car': subject) and 'engine' ('B car': verb or predicate) form the core elements: 'black carriages'. Additional details or context, like objects or modifiers, are 'white carriages'. The wa particle 'flags' a carriage as the topic of a sentence.",
            "vocab_table_extra_notes":"Have a table with 5 na-adjectives and another table with 5 i-adjectives",
            "exercises": {
                "exercise_list": [
                    {
                        "type": "Sentence Translation",
                        "description": "Provide the user with 5 simple sentences in English that contain descriptions using the list of words you've provided, and then have them translate these sentences into Japanese using the correct adjective forms."
                    },
                    {
                        "type": "Adjective Transformation Practice (I-Adjectives and Na-Adjectives)",
                        "description": "Give the user three I-adjectives and three Na-adjectives. Ask them to convert these adjectives into their corresponding adjective forms."
                    },
                    {
                        "type": "Sentence Construction Practice",
                        "description": "Ask the user to write five sentences in Japanese using each of the three types of 'engines' (U-Train, verb sentences; the DA-Train, noun sentences; and the I-Train, so-called adjectival sentences) as described in the lecture."
                    },
                    {
                        "type": "Possessive Sentence Practice",
                        "description": "Provide five simple sentences in English using the possessive form. Have them translate these sentences into Japanese using the possessive particle 'no'."
                    }
                ],
                "marking_comments": ""
            },
            "bonus_lessons": []
        },
        "7": {
            "video_link": "https://www.youtube.com/watch?v=KIPhvGxp43c",
            "lecture_name" : "Japanese negative verbs, and Adjective 'conjugations'",
            "lecture_summary" : "Exploring some so-called 'conjugations' and the concept of negatives in Japanese and how 'nai' is used. The lecture goes into detail about how different aspects have the negative formed for them.",
            "lecture_text": "Today we're going to talk about negatives. And in order to do that we're going to have to introduce one of the fundamental secrets of Japanese that the schools and textbooks almost never tell you. And it makes the whole of Japanese much much easier. But before we get to that, let's look at the fundamental basis of Japanese negatives. The fundamental basis of negatives is the adjective 'nai'. This adjective means 'non-exist / not-be'. The word for 'exist' for any object, any inanimate thing, the sky, the sea, the universe, a grain of rice, a flower, a tree, anything, is 'aru'. So, if we want to say, 'There is a pen / A pen exists', we say 'pen-ga aru'. But if we want to say there isn't a pen, we say 'pen-ga nai'. Now, why do we use a verb for being and an adjective for non-being? Because this happens throughout Japanese. Whenever we DO something we use a verb. Whether we walk, or sing, or run, or anything – that's a verb. But if we don't do it, then we attach 'nai' to the verb and that becomes the engine of the sentence. So when we say we're not doing something, we're not using a verb, we're using an adjective. Why is that? Because Japanese is very logical. When we do something, an action is taking place. That's a verb. But when we don't do it, no action is taking place and we are describing a state of non-action. So, that's an adjective. All right. So, if we want to say, 'There is no pen', we say 'pen-ga nai.' But what if we want to say, 'This is not a pen'? That's not quite the same thing, is it? So, how do we say that? If we want to say 'There is a pen', as we know, we say 'kore-wa ('kore' – 'this')... kore-wa pen-da'. 'As for this, pen = / As for this, it's a pen.' But if we want to say, 'This is not a pen', we say, 'kore-wa, pen-de-wa nai'. So what does that mean? Well, the 'de' is the te-form of 'da' or 'desu'. So we still have 'kore-wa pen-da' in the form of 'kore-wa pen-de' and then we're attaching 'nai'. So what we're saying is, 'As for this, as for being a pen, it isn't / This is not a pen'. All right. So now let's move on to the largest part of this question, which is verbs. In order to put a verb into the negative, we have to attach 'nai', and we do this by attaching it to the a-stem. What does that mean? Well, let's look at the stem system. The Japanese verb-stem system is the simplest, the most logical and the most beautiful verb transformation system in this world. It's almost absolutely regular. Once you know how to do it, you can make any transformation (except for the te- and ta-form, which you already know). But the schools and textbooks don't tell you this. Instead of telling you this, they present each 'conjugation', as they call it (and they aren't in fact conjugations)... they present each one as a separate case with separate rules which appear to be random. And because they don't tell you the fundamental logic of the whole system, and because they describe the changes that take place as if they were really written in the Roman alphabet when they are written in kana, it really looks like that. Students really think they have to treat each case as a separate case and learn separate rules in every case. And you don't have to. You just have to know the stem system. So let's look at it. As we've already learned, every verb ends in one of the u-row kana. And I'm turning the chart on its side here for reasons you'll see in a moment. So these kana in the red box are the ones that can end a verb. It's not every u-row kana, but it's most of them. So we have verbs like 'kau' (buy), 'kiku' (hear), 'hanasu' (speak), 'motsu' (hold) etc. Now, as you can see, there are four other possible ways in which a verb could end. And each of those four ways is used, and they are called the verb-stems. Today we are only going to look at the a-stem, because that's the one we need for the negative. So, to form the a-stem, we simply shift the last kana of the verb from the u-row to the a-row. So 'kiku' (hear) becomes 'kika', 'hanasu' (speak) becomes 'hanasa', 'motsu' (hold) becomes 'mota', and so forth. There's only one exception in this system – and when I say that I mean the whole system, all the stems – there's only this one exception, which is that when a word ends in the u-kana the stem doesn't change to '-a', it changes to '-wa'. So the negative of 'kau' is not 'kaanai', it's 'kawanai'. And it's only in the a-stem that we have this exception, so that's the only exception in the whole system, and I think you can see why it exists: 'kaanai' is not as easy to say as 'kawanai', is it? All the others are perfectly regular. 'Kiku' (hear) becomes 'kikanai' (not-hear); 'hanasu' (speak) becomes 'hanasanai' (not-speak); 'motsu' (hold) becomes 'motanai' (not hold), and so forth. And as we already know, with ichidan verbs, they only ever drop that '-ru' and put on whatever we want to put on, so 'taberu' (eat) becomes 'tabenai' (not-eat). And that's it. That's how we turn any verb negative. It's very, very simple. Now, what about adjectives? How do we make adjectives negative? Well, when we make a transformation to an adjective, what we always do is we turn the '-i' on the end of it into '-ku': 'akai' (is-red) becomes 'akaku'; 'kawaii' (is-cute) becomes 'kawaiku'; kowai (is-scary) becomes 'kowaku'. And this is the way we make the te-form of adjectives: 'akaku' becomes 'akakute'. And it's also the way we make the negative: 'akai' becomes 'akakunai' (not-red). Now interestingly, this -ku is the opposite of what happens in the te-form, isn't it? If a word ends in -ku, in the te-form we turn that -ku into -i. But in an adjective we turn the -i into -ku. If we want to put an adjective into the past tense, we take off the -i and use -katta. So 'kowai' (is-scary) becomes 'kowakatta' (was-scary). And because 'nai' is also an i-adjective, when we put that into the past we also say 'nakatta'. So, if we want to say 'Sakura runs', we say 'Sakura-ga hashiru'; if we want to say 'Sakura doesn't run', we say 'Sakura-ga hashira nai'; if we want to say 'Sakura ran (in the past)', we say 'Sakura-ga hashitta' – because it's a godan verb; and if we want to say 'Sakura didn't run (in the past)', we say 'Sakura-ga hashira nakatta'. 'Hashira nai', and then we put 'nai' into the past: 'hashira nakatta'. Now, as we all know. 'Sakura-ga hashiru' is rather unnatural Japanese, just as it's rather unnatural English. We say 'Sakura is running' in Englsh, and in Japanese we say 'Sakura-ga hashitte iru'. So if we want to put all that in the past, what do we do? Well, all we have to do is put that 'iru' into the past. So we say 'Sakura-ga hashitte ita' – 'Sakura was running'. And if we want to say 'Sakura wasn't running', we say 'Sakura-ga hashitte i-nakatta'. That 'iru' is a simple ichidan verb, so we just drop the -ru and put on ta or nai and, in the past, nakatta. I always say that Japanese is like Lego. Once you know the basic building blocks you can build anything. And there are almost no exceptions in Japanese. In the whole of what we've been talking about today there are really just two exceptions. And I'm going to introduce those so that you know everything you need to know. The only real exception to every verb being made negative by adding 'nai' is the verb 'masu', which is a helper verb that makes words formal. We add it to the i-stem of a verb, and we will look at the i-stem later, but I think you can already guess what it is. So, 'hanasu' becomes 'hanashimasu', 'kiku' becomes 'kikimasu' and so on. When you put 'masu' into the negative, it does not become 'masanai', as you would expect – it becomes 'masen'. Because it's formal, it's a bit old-fashioned and it uses the old Japanese negative 'sen' instead of 'nai'. The only other apparent exception is that 'ii' , the adjective 'ii', which means 'is-good', has an older form, 'yoi', which is still used quite often. And when we make any transformation to 'ii', it turns back to 'yoi', so in the past tense we don't say 'ikatta', we say 'yokatta' – and if you've seen much anime you've probably heard this quite often. 'Yokatta', literally 'zero-ga yokatta' – 'It was good / That turned out well / That's great'. And if you want to say something is not good, you don't say 'ikunai', you say 'yokunai'. And those are the only exceptions.",
            "can_use_romaji": true,
            "knowledge_assumed": "Knows A (is/does) B structures. Familiar with the wa, ni, da, ga, no and wo particles. Understands the meaning of 'te'-form and 'ta'-form and knows how to make them for all types of verbs. Understands 'ni' use for absolute time expressions (e.g. On Saturday) and how to use relative time expressions (e.g. Tomorrow). They know of the train metaphor:  the (sometimes implied and invisible or 'zero-ga') 'main carriage' ('A car': subject) and 'engine' ('B car': verb or predicate) form the core elements: 'black carriages'. Additional details or context, like objects or modifiers, are 'white carriages'. The wa particle 'flags' a carriage as the topic of a sentence. Understands the 3 categories of adjectives and how to use them. ",
            "vocab_table_extra_notes":"Have a table with 3 godan verbs and other with 3 ichidan verbs.",
            "exercises": {
                "exercise_list": [
                    {
                        "type": "Negation Practice",
                        "description": "Provide the user with 6 simple sentences. Two should end with godan verbs, two with ichidan verbs, and two with adjectives. The user should then create the negative versions of these sentences."
                    },
                    {
                        "type": "Negation Quiz",
                        "description": "Give the user 5 sentences in Japanese and ask them to identify whether they are in their correct negative form. Instruct them to identify the ones which are correct, and to correct the ones which are wrong. At least 2 should be correctly made, at least 2 should be wrong. "
                    }
                ],
                "marking_comments": "Once the user is finished with all the exercises, let them know that they will no longer be able to use romaji in 4 lessons time."
            },
            "bonus_lessons": []
        }
        
    }
}
